Enums/ОснованияПрекращенияПособийПоУходу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОснованияПрекращенияПособийПоУходу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриказОДосрочномВыходеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриказОбУвольнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОСмертиРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеОснованийДляВыплатыПособия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнойПриказИлиДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НевозможностьУходаЗаРебеноком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОснованияПрекращенияПособийПоУходу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеЧислом(Значение) Экспорт
	// Признак типа приказа страхователя/документа:
	Если Значение = ПриказОДосрочномВыходеНаРаботу Тогда
		Возврат 1; // О преждевременном выходе на работу.
	ИначеЕсли Значение = ПриказОбУвольнении Тогда
		Возврат 2; // О прекращении трудовых отношений.
	ИначеЕсли Значение = СвидетельствоОСмертиРебенка Тогда
		Возврат 3; // О смерти ребенка.
	ИначеЕсли Значение = ПрекращениеОснованийДляВыплатыПособия Тогда
		Возврат 4; // О прекращение оснований для выплаты пособия.
	ИначеЕсли Значение = ИнойПриказИлиДокумент Тогда
		Возврат 5; // Иное.
	ИначеЕсли Значение = ОтпускПоБеременностиИРодам Тогда
		Возврат 8; // Замена на отпуск по БиР.
	ИначеЕсли Значение = НевозможностьУходаЗаРебеноком Тогда
		Возврат 7; // Невозможность осуществления ухода за ребенком в связи с болезнью получателя.
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ТипСообщения = ОбщегоНазначенияБЗК.ЗначениеСвойства(Параметры, "ТипСообщения");
	Если ТипСообщения = 10410 Тогда
		ДанныеВыбора.Добавить(ПриказОбУвольнении, Строка(ПриказОбУвольнении));
		ДанныеВыбора.Добавить(СвидетельствоОСмертиРебенка, Строка(СвидетельствоОСмертиРебенка));
		ДанныеВыбора.Добавить(ИнойПриказИлиДокумент, Строка(ИнойПриказИлиДокумент));
		ДанныеВыбора.Добавить(ОтпускПоБеременностиИРодам, Строка(ОтпускПоБеременностиИРодам));
		ДанныеВыбора.Добавить(НевозможностьУходаЗаРебеноком, Строка(НевозможностьУходаЗаРебеноком));
	Иначе
		ДанныеВыбора.Добавить(ПриказОДосрочномВыходеНаРаботу, Строка(ПриказОДосрочномВыходеНаРаботу));
		ДанныеВыбора.Добавить(ПриказОбУвольнении, Строка(ПриказОбУвольнении));
		ДанныеВыбора.Добавить(СвидетельствоОСмертиРебенка, Строка(СвидетельствоОСмертиРебенка));
		ДанныеВыбора.Добавить(ПрекращениеОснованийДляВыплатыПособия, Строка(ПрекращениеОснованийДляВыплатыПособия));
		ДанныеВыбора.Добавить(ИнойПриказИлиДокумент, Строка(ИнойПриказИлиДокумент));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
